[
  {
    "author": "suncoastdivecenter",
    "date": "Sep 13, 2025",
    "title": "The water is starting to clean up with cooler temperatures ahead.",
    "excerpt_text": "With the recent cooler weather the viability has started to clean up. Reports from 35 ft out to 70ft have been 15-25ft. Gag grouper...",
    "short_blog_entry": "The water conditions are changing! 'The water is starting to clean up with cooler temperatures ahead.' was the report from suncoastdivecenter on Sep 13, 2025. Visibility is improving, ranging from 15-25ft with cooler temperatures. It's time to dive!"
  },
  {
    "author": "Chad Campbell",
    "date": "Aug 4, 2025",
    "title": "Scallop season winding down and lobster season a full send.",
    "excerpt_text": "Scallop season has been very productive over the last few weeks and is coming to an end. Lobster season is just getting started. Mini...",
    "short_blog_entry": "Get your nets ready for lobster season! According to Chad Campbell's post, 'Scallop season winding down and lobster season a full send.', on Aug 4, 2025, the season is a 'full send' and mini-season has been a huge success, with 'plenty of bugs' around."
  },
  {
    "author": "Chad Campbell",
    "date": "Jul 23, 2025",
    "title": "Scallop season is off and running. Next up Mini season!",
    "excerpt_text": "Scallops are plentiful this year. Most people have been finding them between 5-10 ft in the clean waters off Pasco County. The people...",
    "short_blog_entry": "Dive in! Scallop season is in full swing. 'Scallop season is off and running. Next up Mini season!'! As noted on Jul 23, 2025 by Chad Campbell, the waters are productive, with many finding scallops between 5-10 ft."
  },
  {
    "author": "Chad Campbell",
    "date": "Jul 2, 2025",
    "title": "Scallop Time!",
    "excerpt_text": "It's that time of year again for those tasty morsels. Crystal River opened up yesterday, July 1st, and what a day it was. There are...",
    "short_blog_entry": "Dive in! Scallop season is in full swing. 'Scallop Time!'! As noted on Jul 2, 2025 by Chad Campbell, the waters are productive, with Crystal River having just opened and reporting an abundance of the tasty morsels."
  },
  {
    "author": "Chad Campbell",
    "date": "Jun 20, 2025",
    "title": "The water is clear and warm.",
    "excerpt_text": "The water up off of Clearwater is almost top to bottom in 50ft . Off Pinellas county we only have 10-15ft but at least the water is 80...",
    "short_blog_entry": "The water conditions are changing! 'The water is clear and warm.' was the report from Chad Campbell on Jun 20, 2025. Visibility is improving, with the water up off of Clearwater being almost top to bottom in 50ft, making for excellent diving!"
  },
  {
    "author": "Chad Campbell",
    "date": "Jun 11, 2025",
    "title": "Exploring the Essentials of Scuba Diving Facilities",
    "excerpt_text": "Scuba diving is an exhilarating adventure that allows you to explore the underwater world in a way that few other activities can. From...",
    "short_blog_entry": "A new update is here: 'Exploring the Essentials of Scuba Diving Facilities'! Posted on Jun 11, 2025 by Chad Campbell, the post's excerpt says: 'Scuba diving is an exhilarating adventure that allows you to explore the underwater world in a way that few other activities can. From...' Check out the full post for more details on the current dive conditions and news."
  },
  {
    "author": "Chad Campbell",
    "date": "Jun 5, 2025",
    "title": "the Whale sharks have arrived",
    "excerpt_text": "Whale Shark Migration The whale sharks are currently migrating in the Gulf, making their way north. This annual event attracts divers and...",
    "short_blog_entry": "Gentle giants have arrived! 'the Whale sharks have arrived' announced Chad Campbell on Jun 5, 2025. These majestic whale sharks are migrating in the Gulf, making their way north and attracting divers."
  },
  {
    "author": "Chad Campbell",
    "date": "May 22, 2025",
    "title": "Perfect Waters and Exciting Sales: Memorial Day Weekend in Florida",
    "excerpt_text": "The water is absolutely perfect on both sides of Florida. On the West coast it is top to bottom vis in Pinellas County and 78 degrees...",
    "short_blog_entry": "The water conditions are changing! 'Perfect Waters and Exciting Sales: Memorial Day Weekend in Florida' was the report from Chad Campbell on May 22, 2025. The water is absolutely perfect on both sides of Florida, with top to bottom visibility in Pinellas County. It's time to dive!"
  },
  {
    "author": "Chad Campbell",
    "date": "May 8, 2025",
    "title": "The Water is Warm and Clear!",
    "excerpt_text": "The water is finally 78 degrees and clear. There is a Thermocline out past 80ft. The water south of the channel is top to bottom Vis. ",
    "short_blog_entry": "The water conditions are changing! 'The Water is Warm and Clear!' was the report from Chad Campbell on May 8, 2025. The water is finally 78 degrees with clear, top-to-bottom visibility south of the channel. It's time to dive!"
  },
  {
    "author": "Chad Campbell",
    "date": "Apr 18, 2025",
    "title": "THE WATER IS FINALLY CLEANING UP!!!",
    "excerpt_text": "After what seems like forever, the water is finally getting clean. Between two hurricanes and snowstorms in Florida, we can finally start...",
    "short_blog_entry": "Weather conditions impact the dive! In the post 'THE WATER IS FINALLY CLEANING UP!!!' from Apr 18, 2025, Chad Campbell discusses the effects of a hurricane or cold front. Visibility is finally cleaning up after what seemed like forever, and dive season is ready to resume."
  },
  {
    "author": "suncoastdivecenter",
    "date": "Apr 2, 2025",
    "title": "Dive Season is Here!!!",
    "excerpt_text": "As the weather warms up and the days grow longer, divers everywhere are gearing up for an exciting dive season. Whether you're a seasoned...",
    "short_blog_entry": "A new update is here: 'Dive Season is Here!!!'! Posted on Apr 2, 2025 by suncoastdivecenter, the post's excerpt says: 'As the weather warms up and the days grow longer, divers everywhere are gearing up for an exciting dive season. Whether you're a seasoned...' Check out the full post for more details on the current dive conditions and news."
  },
  {
    "author": "Chad Campbell",
    "date": "Jul 7, 2023",
    "title": "Gearing up for LOBSTER SEASON!!! Scallop season initial reports!",
    "excerpt_text": "With Sportman season getting ready to start July 26 and 27th of 2023 ; we are in full blown summer mode. The 2 day season is set to...",
    "short_blog_entry": "Get your nets ready for lobster season! According to Chad Campbell's post, 'Gearing up for LOBSTER SEASON!!! Scallop season initial reports!', on Jul 7, 2023, the season is a 'full send' and mini-season has been a huge success, with 'plenty of bugs' around."
  },
  {
    "author": "Chad Campbell",
    "date": "Jun 28, 2023",
    "title": "Scallop season opens in Pasco July 1st!!!",
    "excerpt_text": "Scallop season starts this weekend out of Pasco. Check with myfwc.com for all the updated info and regions. Red snapper season started...",
    "short_blog_entry": "Dive in! Scallop season is in full swing. 'Scallop season opens in Pasco July 1st!!!'! As noted on Jun 28, 2023 by Chad Campbell, the waters are productive, with the season starting this weekend out of Pasco."
  },
  {
    "author": "Chad Campbell",
    "date": "Jun 14, 2023",
    "title": "Red Snapper and Scallops",
    "excerpt_text": "Summer is definantly in full swing and plenty to keep us all busy over the next several months. Red snapper season opens this Friday and...",
    "short_blog_entry": "Dive in! Scallop season is in full swing. 'Red Snapper and Scallops'! As noted on Jun 14, 2023 by Chad Campbell, the waters are productive, with summer keeping everyone busy and red snapper season opening this Friday."
  },
  {
    "author": "Chad Campbell",
    "date": "May 27, 2023",
    "title": "Memorial Day",
    "excerpt_text": "This weekend looks to be one of the best all year. With water temps. in the high 70's and low 80's depending on where you are on the...",
    "short_blog_entry": "The water conditions are changing! 'Memorial Day' was the report from Chad Campbell on May 27, 2023. This weekend looks to be one of the best all year, with water temps in the high 70's and low 80's. It's time to dive!"
  },
  {
    "author": "Chad Campbell",
    "date": "May 11, 2023",
    "title": "The Whale Sharks are starting to move.",
    "excerpt_text": "There have been a few sightings over the past week South of the channel in 100+ foot of water of these gentle giants. This weekend might...",
    "short_blog_entry": "Gentle giants have arrived! 'The Whale Sharks are starting to move.' announced Chad Campbell on May 11, 2023. These majestic whale sharks are migrating in the Gulf, with a few sightings over the past week in 100+ foot of water."
  },
  {
    "author": "suncoastdivecenter",
    "date": "Apr 22, 2023",
    "title": "Whale Sharks in 60ft!!!!",
    "excerpt_text": "We have been seeing a few whale sharks as shallow as 60 ft off Johns pass. The water temps are now in the 70's in 50ft and a little...",
    "short_blog_entry": "Gentle giants have arrived! 'Whale Sharks in 60ft!!!!' announced suncoastdivecenter on Apr 22, 2023. These majestic whale sharks are migrating in the Gulf, with sightings reported in waters as shallow as 60ft off Johns pass."
  },
  {
    "author": "suncoastdivecenter",
    "date": "Apr 6, 2023",
    "title": "Water and Temps are a go !! + Whale Shark 's",
    "excerpt_text": "This week we have had unseasonably warmer weather and calm water. The vis. is the best we have seen in 8 months. Water vis in 60 ft is...",
    "short_blog_entry": "Gentle giants have arrived! 'Water and Temps are a go !! + Whale Shark 's' announced suncoastdivecenter on Apr 6, 2023. These majestic whale sharks are migrating in the Gulf, with unseasonably warmer weather bringing calm water and the best visibility seen in 8 months."
  },
  {
    "author": "suncoastdivecenter",
    "date": "Mar 16, 2023",
    "title": "Great Whites in the gulf!!!",
    "excerpt_text": "It's that time of year where the great white sharks start to make thier migration south from the Gulf of Mexico around the Florida Keys...",
    "short_blog_entry": "A new update is here: 'Great Whites in the gulf!!!'! Posted on Mar 16, 2023 by suncoastdivecenter, the post's excerpt says: 'It's that time of year where the great white sharks start to make thier migration south from the Gulf of Mexico around the Florida Keys...' Check out the full post for more details on the current dive conditions and news."
  },
  {
    "author": "suncoastdivecenter",
    "date": "Feb 17, 2023",
    "title": "It was fun while it lasted!",
    "excerpt_text": "After this last weeks cold front visibility went from 40+ foot in the Gulf to less than a foot. With warmer temps and calmer weather...",
    "short_blog_entry": "Weather conditions impact the dive! In the post 'It was fun while it lasted!' from Feb 17, 2023, suncoastdivecenter discusses the effects of a hurricane or cold front. Visibility went from 40+ foot in the Gulf to less than a foot after the last cold front, but warmer temps are expected to help it recover."
  },
  {
    "author": "suncoastdivecenter",
    "date": "Feb 4, 2023",
    "title": "The water is Warming up.",
    "excerpt_text": "The weather last week was nearly perfect. The water vis. was 40-60ft and 63 degrees. With a front moving in this weekend it will bring...",
    "short_blog_entry": "The water conditions are changing! 'The water is Warming up.' was the report from suncoastdivecenter on Feb 4, 2023. The weather last week was nearly perfect with 40-60ft visibility, though a new front is moving in. It's time to dive!"
  },
  {
    "author": "suncoastdivecenter",
    "date": "Jan 20, 2023",
    "title": "Water will warm up this week.",
    "excerpt_text": "Most people do not realize that Florida has some brutal winter temps for us locals. The water right ranges this time of year between 55...",
    "short_blog_entry": "The water conditions are changing! 'Water will warm up this week.' was the report from suncoastdivecenter on Jan 20, 2023. This time of year brings brutal winter temps, with water right now ranging between 55-60 degrees. It's time to dive!"
  },
  {
    "author": "suncoastdivecenter",
    "date": "Jan 9, 2023",
    "title": "Water Vis!!",
    "excerpt_text": "Visibility in the Gulf has improved this week after the masssive cold front. In 60ft it was Top to bottom and 59 degrees. With the...",
    "short_blog_entry": "The water conditions are changing! 'Water Vis!!' was the report from suncoastdivecenter on Jan 9, 2023. Visibility in the Gulf has improved after a massive cold front, showing 'Top to bottom' in 60ft of water at 59 degrees. It's time to dive!"
  },
  {
    "author": "suncoastdivecenter",
    "date": "Dec 30, 2022",
    "title": "Last Call.",
    "excerpt_text": "With this weeks blistering cold front the red tide has subsided for now. The weather brought rough and cold conditions to Florida. ",
    "short_blog_entry": "Beware of the red tide. On Dec 30, 2022, suncoastdivecenter warned in 'Last Call.' that with the weeks blistering cold front, the red tide has subsided for now, though it brought rough and cold conditions to Florida."
  },
  {
    "author": "suncoastdivecenter",
    "date": "Dec 9, 2022",
    "title": "Red Tide is back!!!!",
    "excerpt_text": "Unfortuatley red tide has reared it's ugly head south of John's Pass. If you are looking for visibility go North off of Clearwater. ",
    "short_blog_entry": "Beware of the red tide. On Dec 9, 2022, suncoastdivecenter warned in 'Red Tide is back!!!!' that red tide had 'reared its ugly head south of John's Pass,' suggesting divers head north off of Clearwater for better visibility."
  },
  {
    "author": "suncoastdivecenter",
    "date": "Dec 2, 2022",
    "title": "Visibility is starting to improve.",
    "excerpt_text": "With all of the hurrricanes and cold front's hitting us the visibility has been so so. This past week it has started to improve. At 45...",
    "short_blog_entry": "The water conditions are changing! 'Visibility is starting to improve.' was the report from suncoastdivecenter on Dec 2, 2022. Visibility has been poor due to hurricanes and cold fronts but has started to improve, with 25-30ft vis at 45ft deep. It's time to dive!"
  },
  {
    "author": "suncoastdivecenter",
    "date": "Nov 17, 2022",
    "title": "Visibility is starting to shape up after the hurricane.",
    "excerpt_text": "The vis. has started improving this week after hurricane Nicole. The vis on Sat 11/17/2022 was less than a foot from 30ft-70ft. On...",
    "short_blog_entry": "Weather conditions impact the dive! In the post 'Visibility is starting to shape up after the hurricane.' from Nov 17, 2022, suncoastdivecenter discusses the effects of a hurricane or cold front. The visibility has started improving this week after hurricane Nicole, showing a dramatic change from less than a foot to 15-20ft."
  },
  {
    "author": "suncoastdivecenter",
    "date": "Nov 7, 2022",
    "title": "Visibility like the Caribbean.",
    "excerpt_text": "We have been waiting along time for vis. like this. Last week we could see the boat in 60ft from the bottom. Anywhere inside of 60ft...",
    "short_blog_entry": "The water conditions are changing! 'Visibility like the Caribbean.' was the report from suncoastdivecenter on Nov 7, 2022. Divers have been waiting a long time for vis like this, with the ability to see the boat from the bottom in 60ft. It's time to dive!"
  },
  {
    "author": "suncoastdivecenter",
    "date": "Oct 19, 2022",
    "title": "Vis is getting good",
    "excerpt_text": "Friday was a great day out on the gulf in 50 ft with visibility being top to bottom. There are plenty of fish and the water looked like...",
    "short_blog_entry": "The water conditions are changing! 'Vis is getting good' was the report from suncoastdivecenter on Oct 19, 2022. Friday was a great day with top-to-bottom visibility in 50 ft, with plenty of fish to be seen. It's time to dive!"
  },
  {
    "author": "suncoastdivecenter",
    "date": "Oct 7, 2022",
    "title": "Thank You Ian",
    "excerpt_text": "We hope everyone made it through Hurricane Ian ok. Our neighbours 50 miles south of us did not fair so well. We have been doing relief...",
    "short_blog_entry": "Weather conditions impact the dive! In the post 'Thank You Ian' from Oct 7, 2022, suncoastdivecenter discusses the effects of a hurricane or cold front. They express well wishes for those affected by Hurricane Ian and note they have been assisting with relief efforts."
  },
  {
    "author": "suncoastdivecenter",
    "date": "Sep 9, 2022",
    "title": "Vis. in the gulf",
    "excerpt_text": "The vis in the gulf can't make up it's mind. It hav varried from north, south, shallow and deep. There seems to be pockets of dirty...",
    "short_blog_entry": "The water conditions are changing! 'Vis. in the gulf' was the report from suncoastdivecenter on Sep 9, 2022. The visibility in the Gulf is unpredictable, varying from north to south and shallow to deep, with pockets of dirty water. It's time to dive!"
  },
  {
    "author": "suncoastdivecenter",
    "date": "Aug 19, 2022",
    "title": "Vis is better North of Johns pass",
    "excerpt_text": "The Visibility is getting better north of Johns pass. Out of Johns pass we have had anywhere from 5ft in 120 ft of water to 12 ft in...",
    "short_blog_entry": "The water conditions are changing! 'Vis is better North of Johns pass' was the report from suncoastdivecenter on Aug 19, 2022. Visibility is improving north of Johns pass, while the area out of Johns pass has varied from 5ft to 12ft. It's time to dive!"
  },
  {
    "author": "suncoastdivecenter",
    "date": "Aug 6, 2022",
    "title": "It's officially the start of lobster season.",
    "excerpt_text": "Lobster season officially starts today Aug 6. After mini season it looks like a great year to be a diver. There is plenty of bugs...",
    "short_blog_entry": "Get your nets ready for lobster season! According to suncoastdivecenter's post, 'It's officially the start of lobster season.', on Aug 6, 2022, the season looks like a great year to be a diver, with plenty of bugs following the mini-season success."
  },
  {
    "author": "suncoastdivecenter",
    "date": "Jul 28, 2022",
    "title": "Mini Season Success!",
    "excerpt_text": "It has been a successful mini lobster season so far. Plenty of bugs in less than 5 ft of water; So the younger generation of lobster can...",
    "short_blog_entry": "Get your nets ready for lobster season! According to suncoastdivecenter's post, 'Mini Season Success!', on Jul 28, 2022, the season is a 'full send' and mini-season has been a huge success, with 'plenty of bugs in less than 5 ft of water'."
  },
  {
    "author": "suncoastdivecenter",
    "date": "Jul 23, 2022",
    "title": "The Count Down to Lobster Mini Season",
    "excerpt_text": "Mini season is approaching quickly. This year it falls on July 27 and 28th. There have been reports of numerous crustaceans crawling...",
    "short_blog_entry": "Get your nets ready for lobster season! According to suncoastdivecenter's post, 'The Count Down to Lobster Mini Season', on Jul 23, 2022, the season is a 'full send' and mini-season has been a huge success, with reports of numerous crustaceans crawling around as the July 27-28 mini-season approaches."
  },
  {
    "author": "suncoastdivecenter",
    "date": "Jul 11, 2022",
    "title": "The best way to stay cool in this heat!!!!",
    "excerpt_text": "It has been a fantastic week to be underwater cooling off from this heat. Visibility in depths greater than 60ft has been 25-70ft. With...",
    "short_blog_entry": "The water conditions are changing! 'The best way to stay cool in this heat!!!!' was the report from suncoastdivecenter on Jul 11, 2022. It has been a fantastic week to be underwater, with great visibility ranging from 25-70ft in depths greater than 60ft. It's time to dive!"
  },
  {
    "author": "suncoastdivecenter",
    "date": "Jun 30, 2022",
    "title": "Scallop season to open",
    "excerpt_text": "Scallop season is set to open in most areas Friday (check myfwc.com for boundaries). Some of the best times with the family and teaching...",
    "short_blog_entry": "Dive in! Scallop season is in full swing. 'Scallop season to open'! As noted on Jun 30, 2022 by suncoastdivecenter, the waters are productive, with the season set to open in most areas on Friday, making for great family time."
  },
  {
    "author": "suncoastdivecenter",
    "date": "Jun 16, 2022",
    "title": "Whale sharks Again and Opening of red snapper",
    "excerpt_text": "The visibility varies out front . Down near the channel we have had 10 ft or less from 35ft-65ft. There are plenty of grouper and hogs...",
    "short_blog_entry": "Gentle giants have arrived! 'Whale sharks Again and Opening of red snapper' announced suncoastdivecenter on Jun 16, 2022. These majestic whale sharks are migrating in the Gulf, with reports of varied visibility and plenty of grouper and hogs in the water."
  },
  {
    "author": "suncoastdivecenter",
    "date": "Jun 2, 2022",
    "title": "Visibility Doesn't Get Any Better",
    "excerpt_text": "This past weekend showed us just why the Gulf of Mexico is one of the best places to dive. In 60 ft the water was top to bottom. When we...",
    "short_blog_entry": "The water conditions are changing! 'Visibility Doesn't Get Any Better' was the report from suncoastdivecenter on Jun 2, 2022. This past weekend showed that the Gulf of Mexico is one of the best places to dive, with top-to-bottom water visibility in 60 ft."
  },
  {
    "author": "suncoastdivecenter",
    "date": "May 20, 2022",
    "title": "Whale Sharks",
    "excerpt_text": "The water has finally heated up to 77 degrees and the visibility couldn't get any better. Visibility in 50 ft this past week has been top...",
    "short_blog_entry": "Gentle giants have arrived! 'Whale Sharks' announced suncoastdivecenter on May 20, 2022. These majestic whale sharks are migrating in the Gulf, with the water finally heating up to 77 degrees and providing top visibility in 50 ft."
  },
  {
    "author": "suncoastdivecenter",
    "date": "May 12, 2022",
    "title": "50+ foot of visibility",
    "excerpt_text": "The weather looks perfect for the weekend. Visibility has been improving and in 90 ft of water there was 50 plus foot of vis. The pool...",
    "short_blog_entry": "The water conditions are changing! '50+ foot of visibility' was the report from suncoastdivecenter on May 12, 2022. The weather looks perfect for the weekend, with improving visibility reaching 50+ feet in 90 ft of water. It's time to dive!"
  },
  {
    "author": "suncoastdivecenter",
    "date": "May 2, 2022",
    "title": "Visibility 30 ft in 60 foot of water.",
    "excerpt_text": "The Visibility has improved over the last week. In 60 ft of water we are getting over 30 foot of vis. The deeper the vis improves to...",
    "short_blog_entry": "The water conditions are changing! 'Visibility 30 ft in 60 foot of water.' was the report from suncoastdivecenter on May 2, 2022. The visibility has improved over the last week, with over 30 foot of vis in 60 ft of water. It's time to dive!"
  },
  {
    "author": "suncoastdivecenter",
    "date": "Apr 9, 2022",
    "title": "The KINGFISH are here!!!!",
    "excerpt_text": "Yes as a diver this is very good news. Those of us that have been diving Pinellas county for awhile know that as these migratory fish...",
    "short_blog_entry": "A new update is here: 'The KINGFISH are here!!!!'! Posted on Apr 9, 2022 by suncoastdivecenter, the post's excerpt says: 'Yes as a diver this is very good news. Those of us that have been diving Pinellas county for awhile know that as these migratory fish...' Check out the full post for more details on the current dive conditions and news."
  },
  {
    "author": "suncoastdivecenter",
    "date": "Mar 4, 2022",
    "title": "3 degrees!!!! Getting Better",
    "excerpt_text": "Water temp was 61 degrees and Visibility was nearly Top to Bottom from 60 foot to 100ft.",
    "short_blog_entry": "The water conditions are changing! '3 degrees!!!! Getting Better' was the report from suncoastdivecenter on Mar 4, 2022. The water temp was 61 degrees, and visibility was nearly Top to Bottom from 60 foot to 100ft. It's time to dive!"
  },
  {
    "author": "suncoastdivecenter",
    "date": "Feb 18, 2022",
    "title": "Water is heating up and the Visibility starting to improve!!!!",
    "excerpt_text": "Spring time is approaching and the time to start getting ready is now. The visibility is starting to shape up from these winter time...",
    "short_blog_entry": "The water conditions are changing! 'Water is heating up and the Visibility starting to improve!!!!' was the report from suncoastdivecenter on Feb 18, 2022. Springtime is approaching, and visibility is starting to shape up after the winter. It's time to dive!"
  }
]